INSERT INTO `review` 
(`storeName`, `menu`,`userName`,`point`, `review`,`createdAt`, `updatedAt`)
VALUES ('배달삼겹','삼겹혼밥세트', '이정재',4.5, '배불리 먹었어요 추천!',  '2025-03-07 18:10:24' , '2025-03-07 18:10:24'), 
('도미노피자','콤비네이션L', '강동원',3.0,'너무 식어서 왔어요!', '2025-03-08 15:20:00','2025-03-08 15:20:00'), 
('BHC','마쵸킹', '전지현',5.0,'매우만족', '2025-03-08 17:20:00','2025-03-08 17:20:00'), 
('BBQ','올리브치킨', '이병헌',4.5, NULL, '2025-03-09 18:00:30','2025-03-09 18:00:30'), 
('피자반올림','하와이안피자', '이병헌',2.0,'누가 피자에 파인애플 맛있다고했어!', '2025-03-09 20:10:24','2025-03-09 20:10:24'), 
('교촌치킨','허니오리지날', '강동원',4.5,'역시 교촌은 허니 오리지날이죠!', '2025-03-10 14:30:50','2025-03-10 14:30:50'), 
('배달삼겹','목살혼밥세트', '이정재',4.0,NULL, '2025-03-10 19:43:56','2025-03-10 19:43:56'), 
('BHC','핫후라이드', '전지현',5.0,'오늘은 평범한맛!', '2025-03-11 13:05:12','2025-03-11 13:05:12'), 
('안동찜닭','매콤찜닭(소)', '맛있으면짖는개',4.0,'왈왈왈!!! 왈왈!!', '2025-03-11 15:15:33','2025-03-11 15:15:33'), 
('교촌치킨','오리지날콤보', '맛있으면짖는개',3.0,'....','2025-03-12 19:25:36', '2025-03-12 19:25:36'), 
('BHC','뿌링클', '전지현',5.0, NULL,  '2025-03-13 16:43:43','2025-03-13 16:43:43'), 
('배달삼겹','삼겹혼밥세트', '강동원',4.0,'오늘도 배부르게 잘 먹었습니다. 푸짐해요', '2025-03-13 22:33:24','2025-03-13 22:33:24'), 
('원조 곱창볶음','순대곱창볶음', '이정재',2.5,'먹고 탈났어요 ㅠ', '2025-03-14 11:24:43','2025-03-14 11:24:43'), 
('버거킹','콰토르치즈와퍼세트', '이병헌',4.0, NULL,  '2025-03-14 20:42:45','2025-03-14 20:42:45'),
('안동찜닭','찜닭(중)', '이정재',1.0, '배달이 안왔어요.',  '2025-03-15 20:42:45','2025-03-15 20:42:45'),
('버거킹','콰토르치즈와퍼세트', '이병헌',4.0, NULL,  '2025-03-16 20:42:45','2025-03-16 20:42:45');

-- 1. 별점 조건
-- 별점이 3.0 이하인 리뷰의 모든 필드를 조회하세요.
-- 결과 행 개수 : 5
SELECT * FROM `review` WHERE `point` <= 3.0;

-- 2. 복합 조건
-- 교촌치킨의 리뷰내용이 있는 행만 조회하세요.
-- 메뉴, 리뷰내용, 별점만 조회하세요.
-- 결과 행 개수 : 3
SELECT `menu`, `review`, `point` FROM `review` WHERE `storeName` = '교촌치킨' AND `review` IS NOT NULL;

-- 3. 개수 세기
-- 전지현이 BHC 를 총 몇번 시켰는지 조회하세요.
-- 결과 : 4
SELECT count(*) FROM `review` WHERE `storeName` = 'BHC' AND `userName` = '전지현';

-- 4. 날짜 조건
-- 강동원의 리뷰중 2025-03-10 이후 (2025-03-11 부터) 작성한 리뷰의 모든 필드를 조회하세요.
-- 결과 행 개수 : 1
SELECT * FROM `review` WHERE `createdAt` >= '2025-03-10 23:59:59' AND `userName`='강동원';

-- 5. 복합 조건
-- 이정재의 리뷰중에 리뷰내용이 있거나 별점이 4.5 이상인 모든 필드를 조회하세요.
-- 결과 행 개수 : 5
SELECT * FROM `review` WHERE (`review` IS NOT NULL OR `point` >= 4.5) AND `userName`='이정재';